
dicta={"Нидерланды":"Амстердам","Греция":"Афины","Словакия":"Братислава","Польша":"Варшава","Литва":"Вильнюс",
"Великобритания":"Лондон","Белоруссия":"Минск","Монако":"Монако","Россия":"Москва","Франция":"Париж",
"Чехия":"Прага","Италия":"Рим","Швеция":"Стокгольм","Финляндия":"Хельсинки"," Черногория":"Подгорица","Китай":"Пекин","Греция":"Афины","Казахстан":"Нурсултан"}
n = int(input("Выбрать гос-во: Нажмите 1\nВыбрать столицу: Нажмите 2\n"))
if n == 1:
    while True:
        try:
            print("Введите страну из словаря: ")
            country = input("")
            for count, capital in dicta.items():
                if count == country:
                    print(capital)
                    break
            break
        except ValueError:
            print('Необходимо ввести страну из СЛОВАРЯ')
if n == 2:
    while True:
        try:
            print("Введите столицу из словаря: ")
            cap = input("")
            res = dict((v,k) for k,v in dicta.items())
            print(res[cap])
            break
        except KeyError:
            print("Необходимо ввести столицу из СЛОВАРЯ!")
